       >>SOURCE FORMAT IS FREE
IDENTIFICATION DIVISION.
PROGRAM-ID.  HelloWorld.

PROCEDURE DIVISION.
DisplayGreeting.
    DISPLAY "Hello World".
    STOP RUN.
