      $ SET SOURCEFORMAT"FREE"
IDENTIFICATION DIVISION.
PROGRAM-ID.  POSTAGE-RATE  IS INITIAL PROGRAM.
AUTHOR.  Michael Coughlan.
DATA DIVISION.
LINKAGE SECTION.
01      POST-NUM-LA                 PIC 99.
01	POST-CHARGE-LA		    PIC 99V99.

PROCEDURE DIVISION USING POST-NUM-LA, POST-CHARGE-LA.
BEGIN.
   EVALUATE POST-NUM-LA
      WHEN     1            MOVE 1.25 TO POST-CHARGE-LA
      WHEN     2            MOVE 1.35 TO POST-CHARGE-LA
      WHEN     3            MOVE 1.40 TO POST-CHARGE-LA
      WHEN     4            MOVE 1.65 TO POST-CHARGE-LA
      WHEN     5            MOVE 1.90 TO POST-CHARGE-LA
      WHEN     6            MOVE 2.50 TO POST-CHARGE-LA
      WHEN     7            MOVE 2.90 TO POST-CHARGE-LA
      WHEN     8            MOVE 3.50 TO POST-CHARGE-LA
      WHEN     9            MOVE 5.10 TO POST-CHARGE-LA
      WHEN    10            MOVE 8.25 TO POST-CHARGE-LA
      WHEN    11            MOVE 10.25 TO POST-CHARGE-LA
      WHEN    12            MOVE 15.75 TO POST-CHARGE-LA
      END-EVALUATE.
      EXIT PROGRAM.
